app/controllers/cocktails_controller.rb

  def index
    @cocktails = Cocktail.all
---
SELECT "cocktails".* FROM "cocktails"

  def create
    @cocktail = Cocktail.new(params_cocktail)
    @cocktail.save
---
INSERT INTO "cocktails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Mojito"], ["created_at", "2017-05-18 14:18:01.165978"], ["updated_at", "2017-05-18 14:18:01.165978"]]

  def destroy
    @cocktail.destroy
---
DELETE FROM "cocktails" WHERE "cocktails"."id" = $1  [["id", 1]]

  def find_cocktail
    @cocktail = Cocktail.find(params[:id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]