app/controllers/doses_controller.rb

INSERT INTO "doses" ("description", "ingredient_id", "cocktail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "100"], ["ingredient_id", 2], ["cocktail_id", 2], ["created_at", "2017-05-19 09:53:13.481038"], ["updated_at", "2017-05-19 09:53:13.481038"]]
---
  def create
    @dose = Dose.new(params_dose)
    @dose.cocktail = @cocktail
    if @dose.save

SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "doses" WHERE "doses"."id" = $1  [["id", 1]]
---
  def destroy
    @dose = Dose.find(params[:id])
    @dose.destroy

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def find_cocktail
    @cocktail = Cocktail.find(params[:cocktail_id]) #cocktail_id cf routes cocktails/:cocktail_id